In [41]:
import pandas as pd
import numpy as np

In [42]:
A=pd.Series(['a','b','c'])

In [43]:
A

0    a
1    b
2    c
dtype: object

In [44]:
B=["apple",'ball','cat']

In [45]:
C=pd.Series(data=B,index=A)

In [46]:
B

['apple', 'ball', 'cat']

In [47]:
C

a    apple
b     ball
c      cat
dtype: object

In [48]:
B=pd.Series([1,2,3,4],index=[1,4,9,16])

In [49]:
B

1     1
4     2
9     3
16    4
dtype: int64

In [50]:
B

1     1
4     2
9     3
16    4
dtype: int64

In [51]:
B

1     1
4     2
9     3
16    4
dtype: int64

In [52]:
B[4]

2

In [53]:
BB=pd.Series([1,2,5,6],index=[1,4,25,36])

In [54]:
B+BB

1     2.0
4     4.0
9     NaN
16    NaN
25    NaN
36    NaN
dtype: float64

In [55]:
sa=pd.DataFrame(np.random.randn(5,5),['A','B','D','E','F'],['G','H','I','J','K'])

In [56]:
sa

          G         H         I         J         K
A -1.494587 -0.052909  0.899907 -0.240173 -0.032096
B  0.950091 -1.611822 -1.080553 -0.446212 -1.425731
D -2.672059 -0.114507  1.023450 -0.894888  0.389842
E -0.135017  0.183868  1.420070 -0.042713  0.520751
F  1.250217  0.465338  0.511118  0.934299 -0.438638

In [57]:
sa[['G','H']]

          G         H
A -1.494587 -0.052909
B  0.950091 -1.611822
D -2.672059 -0.114507
E -0.135017  0.183868
F  1.250217  0.465338

In [58]:
sa.drop('K',axis=1)

          G         H         I         J
A -1.494587 -0.052909  0.899907 -0.240173
B  0.950091 -1.611822 -1.080553 -0.446212
D -2.672059 -0.114507  1.023450 -0.894888
E -0.135017  0.183868  1.420070 -0.042713
F  1.250217  0.465338  0.511118  0.934299

In [59]:
sa.drop(['K','H'],axis=1,inplace=True)

In [60]:
sa

          G         I         J
A -1.494587  0.899907 -0.240173
B  0.950091 -1.080553 -0.446212
D -2.672059  1.023450 -0.894888
E -0.135017  1.420070 -0.042713
F  1.250217  0.511118  0.934299

In [61]:
sa.drop('I',axis=1)

          G         J
A -1.494587 -0.240173
B  0.950091 -0.446212
D -2.672059 -0.894888
E -0.135017 -0.042713
F  1.250217  0.934299

In [62]:
sa.drop('F')

          G         I         J
A -1.494587  0.899907 -0.240173
B  0.950091 -1.080553 -0.446212
D -2.672059  1.023450 -0.894888
E -0.135017  1.420070 -0.042713

In [63]:
sa.loc['A']

G   -1.494587
I    0.899907
J   -0.240173
Name: A, dtype: float64

In [64]:
sa.iloc[0]

G   -1.494587
I    0.899907
J   -0.240173
Name: A, dtype: float64

In [65]:
sa.loc[['A','B'],['G','I']]

          G         I
A -1.494587  0.899907
B  0.950091 -1.080553

In [66]:
sa.reset_index()

  index         G         I         J
0     A -1.494587  0.899907 -0.240173
1     B  0.950091 -1.080553 -0.446212
2     D -2.672059  1.023450 -0.894888
3     E -0.135017  1.420070 -0.042713
4     F  1.250217  0.511118  0.934299

In [67]:
ana="Hyd che ban mys guj".split()

In [68]:
ana

['Hyd', 'che', 'ban', 'mys', 'guj']

In [69]:
sa['new']=ana

In [70]:
sa

          G         I         J  new
A -1.494587  0.899907 -0.240173  Hyd
B  0.950091 -1.080553 -0.446212  che
D -2.672059  1.023450 -0.894888  ban
E -0.135017  1.420070 -0.042713  mys
F  1.250217  0.511118  0.934299  guj

In [71]:
sa.set_index('new')

            G         I         J
new
Hyd -1.494587  0.899907 -0.240173
che  0.950091 -1.080553 -0.446212
ban -2.672059  1.023450 -0.894888
mys -0.135017  1.420070 -0.042713
guj  1.250217  0.511118  0.934299

In [72]:
sa

          G         I         J  new
A -1.494587  0.899907 -0.240173  Hyd
B  0.950091 -1.080553 -0.446212  che
D -2.672059  1.023450 -0.894888  ban
E -0.135017  1.420070 -0.042713  mys
F  1.250217  0.511118  0.934299  guj

In [73]:
sa>0

       G      I      J   new
A  False   True  False  True
B   True  False  False  True
D  False   True  False  True
E  False   True  False  True
F   True   True   True  True

In [74]:
sa[sa>0]

          G         I         J  new
A       NaN  0.899907       NaN  Hyd
B  0.950091       NaN       NaN  che
D       NaN  1.023450       NaN  ban
E       NaN  1.420070       NaN  mys
F  1.250217  0.511118  0.934299  guj

In [75]:
sa[sa['G']>0]

          G         I         J  new
B  0.950091 -1.080553 -0.446212  che
F  1.250217  0.511118  0.934299  guj

In [76]:
sa[sa['G']>0][['I','J']]

          I         J
B -1.080553 -0.446212
F  0.511118  0.934299

In [77]:
#sa[(sa['J']<0) & sa(sa['I']>0)]

In [78]:
DAS= pd.DataFrame(np.random.randn(5,5),['A','B','C','D','E'],['F','G','H','I','J'])

In [79]:
DAS

          F         G         H         I         J
A  0.186397  0.448093  0.806797 -1.058264 -0.364204
B  1.817730 -0.313040  1.594900 -0.133061  1.678341
C  0.964164 -1.542498 -2.241277 -0.894270  1.487076
D  0.145493  1.468188  1.108099 -1.648758 -1.938638
E -0.521530  1.037195 -0.973679 -0.235563  0.327378

In [80]:
DAS[(DAS['F']>0) & (DAS['H']>0) ]

          F         G         H         I         J
A  0.186397  0.448093  0.806797 -1.058264 -0.364204
B  1.817730 -0.313040  1.594900 -0.133061  1.678341
D  0.145493  1.468188  1.108099 -1.648758 -1.938638

In [81]:
DAS[(DAS['F']>0) | (DAS['H']>0) ]

          F         G         H         I         J
A  0.186397  0.448093  0.806797 -1.058264 -0.364204
B  1.817730 -0.313040  1.594900 -0.133061  1.678341
C  0.964164 -1.542498 -2.241277 -0.894270  1.487076
D  0.145493  1.468188  1.108099 -1.648758 -1.938638

In [91]:
mea = pd.DataFrame({'A':[1,2,3,np.nan],'B':[5,6,7,np.nan],'C':[4,5,6,np.nan]})

In [92]:
mea

     A    B    C
0  1.0  5.0  4.0
1  2.0  6.0  5.0
2  3.0  7.0  6.0
3  NaN  NaN  NaN

In [93]:
mea.fillna(value=mea.mean())

     A    B    C
0  1.0  5.0  4.0
1  2.0  6.0  5.0
2  3.0  7.0  6.0
3  2.0  6.0  5.0

In [94]:
mea

     A    B    C
0  1.0  5.0  4.0
1  2.0  6.0  5.0
2  3.0  7.0  6.0
3  NaN  NaN  NaN

In [96]:
mea['A'].fillna(value='haha',inplace=True)

In [97]:
mea

      A    B    C
0     1  5.0  4.0
1     2  6.0  5.0
2     3  7.0  6.0
3  haha  NaN  NaN

In [104]:
reea = pd.DataFrame({'F':[np.nan,2,3,np.nan],'G':[5,np.nan,7,np.nan],'H':[4,5,6,7]})

In [105]:
reea

     F    G  H
0  NaN  5.0  4
1  2.0  NaN  5
2  3.0  7.0  6
3  NaN  NaN  7

In [106]:
reea.dropna()

     F    G  H
2  3.0  7.0  6

In [107]:
reea.dropna(axis=1)

   H
0  4
1  5
2  6
3  7

In [108]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [109]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [110]:
Ka=pd.DataFrame(data)

In [111]:
Ka

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [114]:
Ka.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [115]:
Ka.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [117]:
Ka.std()

Sales    100.899455
dtype: float64

In [118]:
Ka

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [121]:
Ka.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [122]:
Ka.mean()

Sales    229.5
dtype: float64

In [126]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [127]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [128]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [130]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [132]:
df.mean()

col1      2.50
col2    527.25
dtype: float64

In [137]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [138]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [139]:
df['col2'].nunique()  #no.of.unique values

3

In [140]:
df.nunique()

col1    4
col2    3
col3    4
dtype: int64

In [141]:
def times2(x):
    return x*2

In [142]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [145]:
df.apply(lambda x:x*2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [143]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [144]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [9]:
import pandas as pd
import numpy as np
DP=pd.DataFrame((np.random.randint(10,100,25)).reshape(5,5),['A','B','C','D','E'],['F','G','H','I','J'])

In [10]:
DP

    F   G   H   I   J
A  87  36  52  48  32
B  33  36  19  56  44
C  26  35  41  42  77
D  87  93  30  27  73
E  24  29  31  52  39

In [14]:
DP['F'].value_counts().head(2)

87    2
26    1
Name: F, dtype: int64

In [20]:
a="asdfgh"
a.split('d')

['as', 'fgh']

In [19]:
a.split('d')[1]

'fgh'

In [23]:
lst=[1,2,3,4,5,6,7,8]

In [24]:
lst[::2]

[1, 3, 5, 7]